# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect("data.sqlite")
c = conn.cursor()

In [2]:
def sql (querry ,cursor = c):
    """Runs a SQL querry and returns results as a Dataframe. cursor Variable is set to 'c' by default. Make sure your run sql_connect before using or set cursor manually """
    c.execute(querry)
    c.fetchall
    df = pd.DataFrame(c.fetchall())
    df.columns = [x[0] for x in c.description]
    return df

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [5]:
sql("""select * from sqlite_master""")

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,customers,customers,33,"CREATE TABLE `customers` (`customerNumber`, `c..."
4,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
5,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
6,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
7,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."

In [20]:
#Your code here
sql("""select lastName,firstName 
from 
employees as e join offices as o 
on e.officeCode = o.officeCode 
where city = "Boston";""")

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [35]:
#Your code here
sql(""" SELECT o.officeCode ,lastName, firstName
from 
customers as c join employees as e 
on c.salesRep = o.officeCode
group by e.officeCode
""")

  officeCode           city  employees
0          1  San Francisco          6
1          2         Boston          2
2          3            NYC          2
3          4          Paris          5
4          5          Tokyo          2
5          6         Sydney          4
6          7         London          2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here
sql(""" SELECT o.officeCode ,city , count(employeeNumber) as  employees 
from 
offices as o left join employees as e 
on e.officeCode = o.officeCode
group by e.officeCode
""")

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!